controllers/xml.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:prof="http://www.intrasoft-internatinal.com/GatewayService/ProfitsExt">
   <soapenv:Header/>
   <soapenv:Body>
      <prof:Adds01_AdditionalTransactionPosting>
         <!--Optional:-->
         <prof:import>
            <!--Optional:-->
            <prof:Command>INSERT</prof:Command>
            <!--Optional:-->
            <prof:InAuthorisationGrantedIefSuppliedFlag>0</prof:InAuthorisationGrantedIefSuppliedFlag>
            <!--Optional:-->
            <prof:InBopGenericDetailShortDescription></prof:InBopGenericDetailShortDescription>
            <!--Optional:-->
            <prof:InCountryGenericDetailShortDescription></prof:InCountryGenericDetailShortDescription>
            <prof:InFxftProductIdProduct>12502</prof:InFxftProductIdProduct>
            <prof:InFxftServiceIdProduct>12502</prof:InFxftServiceIdProduct>
            <!--Optional:-->
            <prof:InGeneralFxFtRecordingCustIdPasspNum>TEST2</prof:InGeneralFxFtRecordingCustIdPasspNum>
            <!--Optional:-->
            <prof:InGlgAccountAccountId></prof:InGlgAccountAccountId>
            <prof:InGlgAccountSecLevel>0</prof:InGlgAccountSecLevel>
            <prof:InInputCurrencyIdCurrency>0</prof:InInputCurrencyIdCurrency>
            <!--Optional:-->
            <prof:InInputCurrencyShortDescr></prof:InInputCurrencyShortDescr>
            <!--Optional:-->
            <prof:InMainFxftFxFtRecordingComments>Comments</prof:InMainFxftFxFtRecordingComments>
            <prof:InMainFxftPrftTransactionIdTransact>12501</prof:InMainFxftPrftTransactionIdTransact>
            <prof:InRecordCaseFxFtRecordingIDrCrFlag>0</prof:InRecordCaseFxFtRecordingIDrCrFlag>
            <prof:InRecordCaseFxFtRecordingISegmentType>0</prof:InRecordCaseFxFtRecordingISegmentType>
            <!--Optional:-->
            <prof:InSectorGenericDetailShortDescription></prof:InSectorGenericDetailShortDescription>
            <prof:InSecurityInBankParametersMaxAmntRateTbl>0</prof:InSecurityInBankParametersMaxAmntRateTbl>
            <prof:InSecurityInBankParametersMaxAmntSrs>0</prof:InSecurityInBankParametersMaxAmntSrs>
            <!--Optional:-->
            <prof:InSecurityInTerminalTerminalNumber></prof:InSecurityInTerminalTerminalNumber>
            <prof:InToBeConvertedIefSuppliedAmount>0</prof:InToBeConvertedIefSuppliedAmount>
            <!--Optional:-->
            <prof:InExportPosting>
               <!--Zero or more repetitions:-->
               <prof:Adds01InExportPostingItem>
                  <prof:InExportPostingInGroupJustificIdJustific>0</prof:InExportPostingInGroupJustificIdJustific>
                  <prof:InExportPostingInGrpChequeBookItemItemSerialNumber>0</prof:InExportPostingInGrpChequeBookItemItemSerialNumber>
                  <prof:InExportPostingInGrpCurrencyIdCurrency>22</prof:InExportPostingInGrpCurrencyIdCurrency>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpCurrencyShortDescr>KES</prof:InExportPostingInGrpCurrencyShortDescr>
                  <prof:InExportPostingInGrpDepUnclearTransAvailabilityDate>0001-01-01T00:00:00</prof:InExportPostingInGrpDepUnclearTransAvailabilityDate>
                  <prof:InExportPostingInGrpDepositAccountCDigit>0</prof:InExportPostingInGrpDepositAccountCDigit>
                  <prof:InExportPostingInGrpDpTrxSpecialAgrAvailDateSpread>0</prof:InExportPostingInGrpDpTrxSpecialAgrAvailDateSpread>
                  <prof:InExportPostingInGrpDpTrxSpecialAgrValueDateSpread>0</prof:InExportPostingInGrpDpTrxSpecialAgrValueDateSpread>
                  <prof:InExportPostingInGrpFdValeurBalanceValueDate>0001-01-01T00:00:00</prof:InExportPostingInGrpFdValeurBalanceValueDate>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpFxFtRecordingComments>Posting_Desricption</prof:InExportPostingInGrpFxFtRecordingComments>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpFxFtRecordingGlAccount>GL_Account</prof:InExportPostingInGrpFxFtRecordingGlAccount>
                  <prof:InExportPostingInGrpFxFtRecordingIDomesticAmount>Amount </prof:InExportPostingInGrpFxFtRecordingIDomesticAmount>
                  <prof:InExportPostingInGrpFxFtRecordingIDrCrFlag>1</prof:InExportPostingInGrpFxFtRecordingIDrCrFlag>
                  <prof:InExportPostingInGrpFxFtRecordingIRate>000001.000000</prof:InExportPostingInGrpFxFtRecordingIRate>
                  <prof:InExportPostingInGrpFxFtRecordingISegmentType>2</prof:InExportPostingInGrpFxFtRecordingISegmentType>
                  <prof:InExportPostingInGrpFxFtRecordingITrxAmount>Amount</prof:InExportPostingInGrpFxFtRecordingITrxAmount>
                  <prof:InExportPostingInGrpFxftJustificIdJustific>12501</prof:InExportPostingInGrpFxftJustificIdJustific>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpIefSuppliedFlag></prof:InExportPostingInGrpIefSuppliedFlag>
                  <prof:InExportPostingInGrpPrftTransactionIdTransact>3191</prof:InExportPostingInGrpPrftTransactionIdTransact>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpProfitsAccountAccountNumber></prof:InExportPostingInGrpProfitsAccountAccountNumber>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpTeamInformationAuthorizationResult></prof:InExportPostingInGrpTeamInformationAuthorizationResult>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpTeamInformationSuper1Code></prof:InExportPostingInGrpTeamInformationSuper1Code>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpTeamInformationSuper2Code></prof:InExportPostingInGrpTeamInformationSuper2Code>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpThirdpartyPaymentTppField1></prof:InExportPostingInGrpThirdpartyPaymentTppField1>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpThirdpartyPaymentTppField2></prof:InExportPostingInGrpThirdpartyPaymentTppField2>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpThirdpartyPaymentTppField3></prof:InExportPostingInGrpThirdpartyPaymentTppField3>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpThirdpartyPaymentTppField4></prof:InExportPostingInGrpThirdpartyPaymentTppField4>
                  <prof:InExportPostingInGrpUnitCode>143</prof:InExportPostingInGrpUnitCode>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpUnitUnitName></prof:InExportPostingInGrpUnitUnitName>
               </prof:Adds01InExportPostingItem>
          
            <prof:Adds01InExportPostingItem>
                  <prof:InExportPostingInGroupJustificIdJustific>33100</prof:InExportPostingInGroupJustificIdJustific>
                  <prof:InExportPostingInGrpChequeBookItemItemSerialNumber>0</prof:InExportPostingInGrpChequeBookItemItemSerialNumber>
                  <prof:InExportPostingInGrpCurrencyIdCurrency>22</prof:InExportPostingInGrpCurrencyIdCurrency>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpCurrencyShortDescr>KES</prof:InExportPostingInGrpCurrencyShortDescr>
                  <prof:InExportPostingInGrpDepUnclearTransAvailabilityDate>0001-01-01T00:00:00</prof:InExportPostingInGrpDepUnclearTransAvailabilityDate>
                  <prof:InExportPostingInGrpDepositAccountCDigit>0</prof:InExportPostingInGrpDepositAccountCDigit>
                  <prof:InExportPostingInGrpDpTrxSpecialAgrAvailDateSpread>0</prof:InExportPostingInGrpDpTrxSpecialAgrAvailDateSpread>
                  <prof:InExportPostingInGrpDpTrxSpecialAgrValueDateSpread>0</prof:InExportPostingInGrpDpTrxSpecialAgrValueDateSpread>
                  <prof:InExportPostingInGrpFdValeurBalanceValueDate>0001-01-01T00:00:00</prof:InExportPostingInGrpFdValeurBalanceValueDate>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpFxFtRecordingComments>Posting_Desricption</prof:InExportPostingInGrpFxFtRecordingComments>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpFxFtRecordingGlAccount></prof:InExportPostingInGrpFxFtRecordingGlAccount>
                  <prof:InExportPostingInGrpFxFtRecordingIDomesticAmount>Amount</prof:InExportPostingInGrpFxFtRecordingIDomesticAmount>
                  <prof:InExportPostingInGrpFxFtRecordingIDrCrFlag>2</prof:InExportPostingInGrpFxFtRecordingIDrCrFlag>
                  <prof:InExportPostingInGrpFxFtRecordingIRate>000001.000000</prof:InExportPostingInGrpFxFtRecordingIRate>
                  <prof:InExportPostingInGrpFxFtRecordingISegmentType>0</prof:InExportPostingInGrpFxFtRecordingISegmentType>
                  <prof:InExportPostingInGrpFxFtRecordingITrxAmount>Amount</prof:InExportPostingInGrpFxFtRecordingITrxAmount>
                  <prof:InExportPostingInGrpFxftJustificIdJustific>12502</prof:InExportPostingInGrpFxftJustificIdJustific>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpIefSuppliedFlag></prof:InExportPostingInGrpIefSuppliedFlag>
                  <prof:InExportPostingInGrpPrftTransactionIdTransact>3181</prof:InExportPostingInGrpPrftTransactionIdTransact>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpProfitsAccountAccountNumber>Fosa_Account</prof:InExportPostingInGrpProfitsAccountAccountNumber>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpTeamInformationAuthorizationResult></prof:InExportPostingInGrpTeamInformationAuthorizationResult>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpTeamInformationSuper1Code></prof:InExportPostingInGrpTeamInformationSuper1Code>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpTeamInformationSuper2Code></prof:InExportPostingInGrpTeamInformationSuper2Code>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpThirdpartyPaymentTppField1></prof:InExportPostingInGrpThirdpartyPaymentTppField1>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpThirdpartyPaymentTppField2></prof:InExportPostingInGrpThirdpartyPaymentTppField2>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpThirdpartyPaymentTppField3></prof:InExportPostingInGrpThirdpartyPaymentTppField3>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpThirdpartyPaymentTppField4></prof:InExportPostingInGrpThirdpartyPaymentTppField4>
                  <prof:InExportPostingInGrpUnitCode>0</prof:InExportPostingInGrpUnitCode>
                  <!--Optional:-->
                  <prof:InExportPostingInGrpUnitUnitName></prof:InExportPostingInGrpUnitUnitName>
               </prof:Adds01InExportPostingItem>
            </prof:InExportPosting>
         </prof:import>
         <!--Optional:-->
         <prof:executionParameters>
            <prof:ChannelId>9912</prof:ChannelId>
            <!--Optional:-->
            <prof:Password>@#000</prof:Password>
            <!--Optional:-->
            <prof:UniqueId>;888888aP8484*8*80</prof:UniqueId>
            <!--Optional:-->
            <prof:CultureName>en</prof:CultureName>
            <prof:ForcastFlag>false</prof:ForcastFlag>
            <!--Optional:-->
            <prof:ReferenceKey>SOMETBECxC21bbvvCCCCSTS</prof:ReferenceKey>
            <!--Optional:-->
            <prof:SotfOtp></prof:SotfOtp>
            <!--Optional:-->
            <prof:BranchCode></prof:BranchCode>
            <!--Optional:-->
            <prof:ExtUniqueUserId>ERPUSER</prof:ExtUniqueUserId>
            <!--Optional:-->
            <prof:ExtDeviceAuthCode></prof:ExtDeviceAuthCode>
         </prof:executionParameters>
      </prof:Adds01_AdditionalTransactionPosting>
   </soapenv:Body>
</soapenv:Envelope>